In [90]:
import pandas as pd
import numpy as np

In [ ]:
news_data=pd.read_csv('./news.tsv',header=None,sep='\t')
news_data.columns=['News id',
"Category",
"SubCategory",
"Title",
"Abstract",
"URL",
"Title entities",
"Abstract entities "]

In [ ]:
news_data=news_data.iloc[:,:5]
news_data.dropna(inplace=True)
news_data.reset_index(drop=True,inplace=True)

In [ ]:
news_data.head(5)

In [91]:
behaviors_data=pd.read_csv('./behaviors.tsv',header=None,sep='\t')

In [92]:
behaviors_data.columns=['Impression id',
"User id",
"Time",
"History",
"Impressions"]

In [93]:
behaviors_data.dropna(inplace=True)
behaviors_data.reset_index(drop=True,inplace=True)

In [94]:
behaviors_data.head(5)

,Impression id,User id,Time,History,Impressions
0,1,U13740,11/11/2019 9:05:58 AM,N55189 N42782 N34694 N45794 N18445 N63302 N104...,N55689-1 N35729-0
1,2,U91836,11/12/2019 6:11:30 PM,N31739 N6072 N63045 N23979 N35656 N43353 N8129...,N20678-0 N39317-0 N58114-0 N20495-0 N42977-0 N...
2,3,U73700,11/14/2019 7:01:48 AM,N10732 N25792 N7563 N21087 N41087 N5445 N60384...,N50014-0 N23877-0 N35389-0 N49712-0 N16844-0 N...
3,4,U34670,11/11/2019 5:28:05 AM,N45729 N2203 N871 N53880 N41375 N43142 N33013 ...,N35729-0 N33632-0 N49685-1 N27581-0
4,5,U8125,11/12/2019 4:11:21 PM,N10078 N56514 N14904 N33740,N39985-0 N36050-0 N16096-0 N8400-1 N22407-0 N6...

In [95]:
len_history=[]
for i in range(len(behaviors_data)):
    len_history.append(len(behaviors_data['History'][i].split(' ')))

In [96]:
behaviors_data['Number of history']=len_history

In [97]:
behaviors_data.head(5)

,Impression id,User id,Time,History,Impressions,Number of history
0,1,U13740,11/11/2019 9:05:58 AM,N55189 N42782 N34694 N45794 N18445 N63302 N104...,N55689-1 N35729-0,9
1,2,U91836,11/12/2019 6:11:30 PM,N31739 N6072 N63045 N23979 N35656 N43353 N8129...,N20678-0 N39317-0 N58114-0 N20495-0 N42977-0 N...,82
2,3,U73700,11/14/2019 7:01:48 AM,N10732 N25792 N7563 N21087 N41087 N5445 N60384...,N50014-0 N23877-0 N35389-0 N49712-0 N16844-0 N...,16
3,4,U34670,11/11/2019 5:28:05 AM,N45729 N2203 N871 N53880 N41375 N43142 N33013 ...,N35729-0 N33632-0 N49685-1 N27581-0,10
4,5,U8125,11/12/2019 4:11:21 PM,N10078 N56514 N14904 N33740,N39985-0 N36050-0 N16096-0 N8400-1 N22407-0 N6...,4

In [99]:
category_history=[]
sub_category_history=[]
for i in range(len(behaviors_data)):
    #len_history.append(len(behaviors_data['History'][i].split(' ')))
    history_list=behaviors_data['History'][i].split(' ')
    #temp_list=[]
    #for j in range(len(history_list)):
    #temp_list.append(news_data[news_data['News id']==history_list[j]]['Category'])
    temp=' '.join(news_data[news_data['News id'].isin(history_list)]['Category'])
    category_history.append(temp)
    #print(i)
    
    temp=' '.join(news_data[news_data['News id'].isin(history_list)]['SubCategory'])
    sub_category_history.append(temp)

    if i%10000==0:
        print(i)

0
10000
20000
30000
40000
50000
60000
70000
80000
90000
100000
110000
120000
130000
140000
150000

In [100]:
behaviors_data['History category']=category_history
behaviors_data['History subcategory']=sub_category_history

In [101]:
behaviors_data.head(5)

,Impression id,User id,Time,History,Impressions,Number of history,History category,History subcategory
0,1,U13740,11/11/2019 9:05:58 AM,N55189 N42782 N34694 N45794 N18445 N63302 N104...,N55689-1 N35729-0,9,news lifestyle tv sports news movies tv news s...,newspolitics lifestylebuzz tvnews baseball_mlb...
1,2,U91836,11/12/2019 6:11:30 PM,N31739 N6072 N63045 N23979 N35656 N43353 N8129...,N20678-0 N39317-0 N58114-0 N20495-0 N42977-0 N...,82,foodanddrink news news news sports news news t...,restaurantsandnews newscrime newsus newsus box...
2,3,U73700,11/14/2019 7:01:48 AM,N10732 N25792 N7563 N21087 N41087 N5445 N60384...,N50014-0 N23877-0 N35389-0 N49712-0 N16844-0 N...,16,lifestyle lifestyle sports tv news lifestyle f...,lifestylehomeandgarden lifestylebuzz football_...
3,4,U34670,11/11/2019 5:28:05 AM,N45729 N2203 N871 N53880 N41375 N43142 N33013 ...,N35729-0 N33632-0 N49685-1 N27581-0,10,finance tv lifestyle sports video sports finan...,markets tv-celebrity lifestylebuzz basketball_...
4,5,U8125,11/12/2019 4:11:21 PM,N10078 N56514 N14904 N33740,N39985-0 N36050-0 N16096-0 N8400-1 N22407-0 N6...,4,travel autos weather health,travelnews autosownership weathertopstories we...

In [102]:
behaviors_data.to_csv('behaviors1.csv', index=False, header=True )

In [108]:
behaviors_data['Time']

0          11/11/2019 9:05:58 AM
1          11/12/2019 6:11:30 PM
2          11/14/2019 7:01:48 AM
3          11/11/2019 5:28:05 AM
4          11/12/2019 4:11:21 PM
                   ...
153722    11/14/2019 10:24:05 PM
153723     11/13/2019 6:57:04 AM
153724    11/14/2019 10:58:13 AM
153725     11/13/2019 2:57:02 PM
153726     11/14/2019 3:25:49 PM
Name: Time, Length: 153727, dtype: object

In [114]:
time=[]
for i in range(len(behaviors_data)):
    #len_history.append(len(behaviors_data['History'][i].split(' ')))
    hour=int(behaviors_data['Time'][i].split(' ')[1].split(':')[0])
    ap=behaviors_data['Time'][i].split(' ')[2]
    if 6<=hour<12 and ap == 'AM': #Morning
        t=0
    if 0<=hour<6 and ap== 'PM': #Afternoon
        t=1
    if 6<=hour<12 and ap=='PM': #Evening
        t=2
    if 0<=hour<6 and ap=='AM': #Night
        t=3 

    time.append(t)

    if i%10000==0:
        print(i)

0
10000
20000
30000
40000
50000
60000
70000
80000
90000
100000
110000
120000
130000
140000
150000

In [115]:
behaviors_data['Time category']=time

In [173]:
behaviors_data[behaviors_data['User id']=='U13740']['Impressions']

0                                         N55689-1 N35729-0
34577     N20020-0 N3737-0 N43202-0 N18708-0 N30125-0 N3...
151651    N13907-0 N8509-0 N47061-0 N51048-0 N22417-0 N3...
Name: Impressions, dtype: object

In [176]:
impressions={}
for i in range(len(behaviors_data)):
     
    userid=behaviors_data['User id'][i]
    
    temp=('-'.join(behaviors_data['Impressions'][i].split(' '))).split('-')[1::2]
    i_list=list(map(int,temp))

    if userid in impressions.keys():
        impressions[userid]=impressions[userid]+i_list
    else:
        impressions[userid]=i_list

0
10000
20000
30000
40000
50000
60000
70000
80000
90000
100000
110000
120000
130000
140000
150000

In [179]:
impressions_rate=[]
for i in range(len(behaviors_data)):
     
    userid=behaviors_data['User id'][i]
    
    impressions_rate.append(sum(impressions[userid])/len(impressions[userid]))

In [180]:
behaviors_data['Impressions_rate']=impressions_rate

In [181]:
behaviors_data.head(5)

,Impression id,User id,Time,History,Impressions,Number of history,History category,History subcategory,Time category,Impressions_rate
0,1,U13740,11/11/2019 9:05:58 AM,N55189 N42782 N34694 N45794 N18445 N63302 N104...,N55689-1 N35729-0,9,news lifestyle tv sports news movies tv news s...,newspolitics lifestylebuzz tvnews baseball_mlb...,0,0.009494
1,2,U91836,11/12/2019 6:11:30 PM,N31739 N6072 N63045 N23979 N35656 N43353 N8129...,N20678-0 N39317-0 N58114-0 N20495-0 N42977-0 N...,82,foodanddrink news news news sports news news t...,restaurantsandnews newscrime newsus newsus box...,2,0.051282
2,3,U73700,11/14/2019 7:01:48 AM,N10732 N25792 N7563 N21087 N41087 N5445 N60384...,N50014-0 N23877-0 N35389-0 N49712-0 N16844-0 N...,16,lifestyle lifestyle sports tv news lifestyle f...,lifestylehomeandgarden lifestylebuzz football_...,0,0.045455
3,4,U34670,11/11/2019 5:28:05 AM,N45729 N2203 N871 N53880 N41375 N43142 N33013 ...,N35729-0 N33632-0 N49685-1 N27581-0,10,finance tv lifestyle sports video sports finan...,markets tv-celebrity lifestylebuzz basketball_...,3,0.142857
4,5,U8125,11/12/2019 4:11:21 PM,N10078 N56514 N14904 N33740,N39985-0 N36050-0 N16096-0 N8400-1 N22407-0 N6...,4,travel autos weather health,travelnews autosownership weathertopstories we...,1,0.014493

In [182]:
behaviors_data.to_csv('behaviors2.csv', index=False, header=True )

In [73]:
behaviors_data.head(5)

,Impression id,User id,Time,History,Impressions,Number of history,History category,History subcategory
0,1,U13740,11/11/2019 9:05:58 AM,N55189 N42782 N34694 N45794 N18445 N63302 N104...,N55689-1 N35729-0,9,"['news', 'lifestyle', 'tv', 'sports', 'news', ...","['newspolitics', 'lifestylebuzz', 'tvnews', 'b..."
1,2,U91836,11/12/2019 6:11:30 PM,N31739 N6072 N63045 N23979 N35656 N43353 N8129...,N20678-0 N39317-0 N58114-0 N20495-0 N42977-0 N...,82,"['foodanddrink', 'news', 'news', 'news', 'spor...","['restaurantsandnews', 'newscrime', 'newsus', ..."
2,3,U73700,11/14/2019 7:01:48 AM,N10732 N25792 N7563 N21087 N41087 N5445 N60384...,N50014-0 N23877-0 N35389-0 N49712-0 N16844-0 N...,16,"['lifestyle', 'lifestyle', 'sports', 'tv', 'ne...","['lifestylehomeandgarden', 'lifestylebuzz', 'f..."
3,4,U34670,11/11/2019 5:28:05 AM,N45729 N2203 N871 N53880 N41375 N43142 N33013 ...,N35729-0 N33632-0 N49685-1 N27581-0,10,"['finance', 'tv', 'lifestyle', 'sports', 'vide...","['markets', 'tv-celebrity', 'lifestylebuzz', '..."
4,5,U8125,11/12/2019 4:11:21 PM,N10078 N56514 N14904 N33740,N39985-0 N36050-0 N16096-0 N8400-1 N22407-0 N6...,4,"['travel', 'autos', 'weather', 'health']","['travelnews', 'autosownership', 'weathertopst..."